cf/Documents/СписаниеСТаможенногоСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>СписаниеСТаможенногоСклада</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ИнтернетЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказНаряд</xr:Item>
				<xr:Item>BusinessProcess.РемонтИнструмента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПартииТоваров</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ДвижениеТовара</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВЯчейках</xr:Item>
				<xr:Item>AccumulationRegister.Взаиморасчеты</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаТаможне</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиПоДисконтнымКартам</xr:Item>
				<xr:Item>AccumulationRegister.ДолгиПоОтгрузкам</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОперацияТаможенногоСписания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетГрузоотправителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетГрузополучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТаможни</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЯчейкаОтправитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯчейкаПолучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПартии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВУпаковке</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентАвтоматическойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаАвтоматическойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Акция</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Акция</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПартияТаможни</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаТаможенныйСклад</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СуммаПартии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/AccumulationRegisters/ТоварыНаТаможне.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаТаможне</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоУпр</Name>
					<Comment>Количество без упаковок</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Партия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Enums/ФормаОтношений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ФормаОтношений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запчасть</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Карта</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/ОперацияТаможенногоСписания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ОперацияТаможенногоСписания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЭтоПеремещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтоПродажа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/ВидыОперацийВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийВзаиморасчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Отгрузка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Catalogs/ИнформационныеКарты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ИнформационныеКарты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКарты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнформационныхКарт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньСкидки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УровниСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодParsec</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПрекращенияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКарты_ст</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоВыдачиКарты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доставка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Documents/СписаниеСТаможенногоСклада/Ext/ManagerModule.bsl
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
														
	|;
	|ВЫБРАТЬ 	СкладОтправитель, СкладПолучатель, Контрагент
	|ИЗ 		Документ.СписаниеСТаможенногоСклада
	|ГДЕ		Ссылка = &Ссылка
	|;
	
	// Товары на складах
	
	|ВЫБРАТЬ
	|	&Период					Период,
	|	&ВидДвиженияПриход		ВидДвижения,
	|	Ссылка.СкладПолучатель	Склад,
	|	Номенклатура,
	|	СУММА(ВЫБОР КОГДА Упаковка = &ПустаяУпаковка 
	|		ТОГДА Количество
	|		ИНАЧЕ Количество * Упаковка.Коэффициент КОНЕЦ) Количество
    |ИЗ
	|	Документ.СписаниеСТаможенногоСклада.Товары
	|
	|ГДЕ Ссылка = &Ссылка И Номенклатура.ТипНоменклатуры <> &Услуга
	|СГРУППИРОВАТЬ ПО Ссылка, Номенклатура, Упаковка, Цена
	|;
	
	// Взвиморасчеты
	
	|ВЫБРАТЬ
	|	&Период				AS Период,
	|	&ВидДвиженияПриход	ВидДвижения,
	|	Партнер				Партнер,
	|	Контрагент			Контрагент,
	|	Организация			Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ФормаОтношений.Клиент) 	ФормаОтношений,
	|	Сумма				Сумма,
	|   Сумма * (ЕСТЬNULL(ВалЦен.Курс, 1) * ЕСТЬNULL(ВалУпр.Кратность, 1)) / (ЕСТЬNULL(ВалУпр.Курс, 1) * ЕСТЬNULL(ВалЦен.Кратность, 1)) СуммаУпр
	|ИЗ
	|	Документ.СписаниеСТаможенногоСклада Док
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ 	РегистрСведений.КурсыВалют.СрезПоследних(, ) ВалЦен
	|	ПО 					Док.Ссылка.Валюта = ВалЦен.Валюта
	|	ЛЕВОЕ СОЕДИНЕНИЕ 	РегистрСведений.КурсыВалют.СрезПоследних(, Валюта В (ВЫБРАТЬ Значение ИЗ Константа.ВалютаУправленческогоУчета)) ВалУпр ПО ИСТИНА
	|
	|ГДЕ Ссылка = &Ссылка И Ссылка.Операция = &ОперацияПродажа;
		
	// Продажи
	
	|ВЫБРАТЬ
	|	&Период					КАК Период,
	|	Ссылка.СкладОтправитель	КАК Склад,
	|	Ссылка.Партнер			КАК Партнер,
	|	Ссылка.Контрагент		КАК Контрагент,
	|	Номенклатура,
	|	Упаковка,
	|	Ссылка				ДокументПродажи,
	|	СУММА(Количество) 	Количество,
	|	СУММА(СуммаПартии) 	Себестоимость,
	|	ВЫБОР 
	|		КОГДА Ссылка.СуммаВключаетНДС 
	|		ТОГДА СУММА(Сумма)		
	|		ИНАЧЕ СУММА(Сумма) + СУММА(СуммаНДС)  КОНЕЦ	Сумма
	|ИЗ
	|	Документ.СписаниеСТаможенногоСклада.Товары
	|
	|ГДЕ Ссылка = &Ссылка И Ссылка.Операция = &ОперацияПродажа
	|СГРУППИРОВАТЬ ПО Ссылка, Номенклатура, Упаковка
	|;
	
	  	
	// Ячейки
	
	|ВЫБРАТЬ
	|	&Период				Период,
	|	&ВидДвиженияРасход	ВидДвижения,
	|	ЯчейкаОтправитель 	Ячейка,
	|	Номенклатура,
	|	СУММА(ВЫБОР КОГДА Упаковка = &ПустаяУпаковка 
	|		ТОГДА Количество
	|		ИНАЧЕ Количество*Упаковка.Коэффициент КОНЕЦ) Количество
    |ИЗ
	|	Документ.СписаниеСТаможенногоСклада.Товары
	|
	|ГДЕ Ссылка = &Ссылка И ЯчейкаОтправитель.Владелец = Ссылка.СкладОтправитель
	|СГРУППИРОВАТЬ ПО ЯчейкаОтправитель, Номенклатура, Упаковка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период				Период,
	|	&ВидДвиженияПриход	ВидДвижения,
	|	ЯчейкаПолучатель 	Ячейка,
	|	Номенклатура,
	|	СУММА(ВЫБОР КОГДА Упаковка = &ПустаяУпаковка 
	|		ТОГДА Количество
	|		ИНАЧЕ Количество*Упаковка.Коэффициент КОНЕЦ) Количество
    |ИЗ
	|	Документ.СписаниеСТаможенногоСклада.Товары
	|
	|ГДЕ Ссылка = &Ссылка И ЯчейкаПолучатель.Владелец = Ссылка.СкладПолучатель
	|
	|СГРУППИРОВАТЬ ПО ЯчейкаПолучатель, Номенклатура, Упаковка;

	
	// Продажи по дисконтным картам
	
	|ВЫБРАТЬ
	|	&Период									 Период,
	|	Ссылка.ДисконтнаяКарта 					 ИнформационнаяКарта,
	|	Ссылка.ДисконтнаяКарта.ВладелецКарты  	 ВладелецКарты,
	|	ВЫБОР 
	|		КОГДА Ссылка.СуммаВключаетНДС 
	|		ТОГДА СУММА(Сумма)		
	|		ИНАЧЕ СУММА(Сумма) + СУММА(СуммаНДС) КОНЕЦ Сумма
	|ИЗ
	|	Документ.СписаниеСТаможенногоСклада.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка И Ссылка.Операция = &ОперацияПродажа И Ссылка.ДисконтнаяКарта <> &ПустаяДисконтнаяКарта
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка
	|;
	
	// Движение товара
	
	|ВЫБРАТЬ
	|	&Период							Период,
	|	&ВидДвиженияПриход				ВидДвижения,
	|	&СкладПолучатель 				Склад,
	|	Номенклатура,
	|	Упаковка,
	|	СУММА(ВЫБОР КОГДА Упаковка = &ПустаяУпаковка 
	|		ТОГДА Количество
	|		ИНАЧЕ Количество*Упаковка.Коэффициент КОНЕЦ) Количество
	|ИЗ
	|	Документ.СписаниеСТаможенногоСклада.Товары
	|ГДЕ
	|	Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура,
	|	Упаковка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период							Период,
	|	&ВидДвиженияПриход				ВидДвижения,
	|	&СкладОтправитель 				Склад,
	|	Номенклатура,
	|	Упаковка,
	|	-СУММА(ВЫБОР КОГДА Упаковка = &ПустаяУпаковка 
	|		ТОГДА Количество
	|		ИНАЧЕ Количество*Упаковка.Коэффициент КОНЕЦ) Количество
	|ИЗ
	|	Документ.СписаниеСТаможенногоСклада.Товары
	|ГДЕ
	|	Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура,
	|	Упаковка;
	
	// ТОВАРЫ НА ТАМОЖНЕ
	
	|ВЫБРАТЬ
	|	&Период					Период,
	|	&ВидДвиженияРасход		ВидДвижения,
	|	Ссылка.СкладОтправитель	Склад,
	|	Ссылка.Валюта			Валюта,
	|	ПартияТаможни			Партия,
	|	Номенклатура,
	|	Упаковка,
	|	СУММА(ЦенаПартии * Количество) Сумма,
	|	СУММА(Количество) 	Количество,
	|	СУММА(
	|		ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА Количество
	|		ИНАЧЕ		Количество * Упаковка.Коэффициент КОНЕЦ) КоличествоУпр
    |ИЗ
	|	Документ.СписаниеСТаможенногоСклада.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка,
	|	ПартияТаможни,
	|	Номенклатура,
	|	Упаковка;
	
	//// Продажи
	//
	//|ВЫБРАТЬ
	//|	&Период					КАК Период,
	//|	Ссылка.СкладОтправитель Склад,
	//|	Ссылка					ДокументПродажи,
	//|	Номенклатура,
	//|	Упаковка,
	//|	СУММА(Количество) 	Количество,
	//|	СУММА(ВЫБОР 
	//|		КОГДА Ссылка.СуммаВключаетНДС 
	//|		ТОГДА Сумма		
	//|		ИНАЧЕ Сумма + СуммаНДС КОНЕЦ) Сумма
	//|ИЗ
	//|	Документ.СписаниеСТаможенногоСклада.Товары
	//|
	//|ГДЕ
	//|	Ссылка = &Ссылка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Ссылка,
	//|	Номенклатура,	
	//|	Упаковка
	//|;

	// ПАРТИИ ТОВАРОВ
	
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	&ВидДвиженияПриход	КАК ВидДвижения,
	|	Ссылка.СкладПолучатель Склад, Партия, Номенклатура,
	|	СУММА(СуммаПартии) Сумма,
	|	ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА
	|		СУММА(Количество)
	|	ИНАЧЕ
	|		СУММА(Количество*Упаковка.Коэффициент)
	|	КОНЕЦ				КАК Количество
	|ИЗ
	|	Документ.СписаниеСТаможенногоСклада.Товары
	|ГДЕ
	|	Ссылка = &Ссылка И СуммаПартии <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка, Партия, Номенклатура, Упаковка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	&ВидДвиженияРасход	КАК ВидДвижения,
	|	Ссылка.СкладОтправитель Склад, Партия, Номенклатура,
	|	СУММА(СуммаПартии) Сумма,
	|	ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА
	|		СУММА(Количество)
	|	ИНАЧЕ
	|		СУММА(Количество*Упаковка.Коэффициент)
	|	КОНЕЦ				КАК Количество
	|ИЗ
	|	Документ.СписаниеСТаможенногоСклада.Товары
	|ГДЕ
	|	Ссылка = &Ссылка И СуммаПартии <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка, Партия, Номенклатура, Упаковка
	|;
	|");
	
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	Запрос.УстановитьПараметр("СкладПолучатель",	Ссылка.СкладПолучатель);
	Запрос.УстановитьПараметр("СкладОтправитель",	Ссылка.СкладОтправитель);
	Запрос.УстановитьПараметр("ПустойСклад", 		Справочники.Склады.ПустаяСсылка());
	Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Услуга", 			Перечисления.ТипыНоменклатуры.Услуга);
	Запрос.УстановитьПараметр("ПустаяЯчейка", 		Справочники.Ячейки.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяДисконтнаяКарта", 	Справочники.ИнформационныеКарты.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяУпаковка", 	Справочники.УпаковкиНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("Сумма", 				Ссылка.Сумма);
	Запрос.УстановитьПараметр("Организация", 		Ссылка.Организация);
	Запрос.УстановитьПараметр("Контрагент", 		Ссылка.Контрагент);
	Запрос.УстановитьПараметр("Партнер", 			Ссылка.Партнер);
	Запрос.УстановитьПараметр("Дата", 				Ссылка.Дата);
	Запрос.УстановитьПараметр("ОперацияПродажа", 	Перечисления.ОперацияТаможенногоСписания.ЭтоПродажа);
	
	Запрос.УстановитьПараметр("ВидОперацииОплата", 	Перечисления.ВидыОперацийВзаиморасчетов.Отгрузка);
	Запрос.УстановитьПараметр("ФормаОтношений", 	Перечисления.ФормаОтношений.Клиент);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	// Воткнем в структуру
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("Шапка", 			КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[2].Выгрузить()));
		
	ДополнительныеСвойства.Вставить("ТоварыНаСкладах", 			Пакет[2].Выгрузить());
	ДополнительныеСвойства.Вставить("Взаиморасчеты", 			Пакет[3].Выгрузить());
	ДополнительныеСвойства.Вставить("Продажи", 					Пакет[4].Выгрузить());
	ДополнительныеСвойства.Вставить("ТоварыВЯчейках",			Пакет[5].Выгрузить());
	ДополнительныеСвойства.Вставить("ПродажиПоДисконтнымКартам",Пакет[6].Выгрузить());
	ДополнительныеСвойства.Вставить("ДвижениеТовара",			Пакет[7].Выгрузить());
	ДополнительныеСвойства.Вставить("ТоварыНаТаможне",			Пакет[8].Выгрузить());
	//ДополнительныеСвойства.Вставить("Продажи",					Пакет[9].Выгрузить());
	ДополнительныеСвойства.Вставить("ПартииТоваров",			Пакет[9].Выгрузить());
		
КонецПроцедуры

Процедура ПроверитьПартииТаможни(Ссылка,Отказ) Экспорт
//Проверяем ПартииТаможни	
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	СписаниеСТаможенногоСкладаТовары.Номенклатура,
		                      |	МАКСИМУМ(СписаниеСТаможенногоСкладаТовары.ПартияТаможни.Дата) КАК ПартияТаможниДата
		                      |ПОМЕСТИТЬ СписокНоменклатуры
		                      |ИЗ
		                      |	Документ.СписаниеСТаможенногоСклада.Товары КАК СписаниеСТаможенногоСкладаТовары
		                      |ГДЕ
		                      |	СписаниеСТаможенногоСкладаТовары.Ссылка = &Ссылка
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	СписаниеСТаможенногоСкладаТовары.Номенклатура
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ТоварыНаТаможнеОстатки.Партия КАК ПартияТаможни,
		                      |	ТоварыНаТаможнеОстатки.Номенклатура КАК Номенклатура
		                      |ПОМЕСТИТЬ СписокПартий
		                      |ИЗ
		                      |	РегистрНакопления.ТоварыНаТаможне.Остатки(
		                      |			&Дата,
		                      |			Склад = &Склад
		                      |				И Номенклатура В
		                      |					(ВЫБРАТЬ
		                      |						СписокНоменклатуры.Номенклатура
		                      |					ИЗ
		                      |						СписокНоменклатуры КАК СписокНоменклатуры)) КАК ТоварыНаТаможнеОстатки
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокНоменклатуры КАК СписокНоменклатуры
		                      |		ПО ТоварыНаТаможнеОстатки.Номенклатура = СписокНоменклатуры.Номенклатура
		                      |			И ТоварыНаТаможнеОстатки.Партия.Дата <= СписокНоменклатуры.ПартияТаможниДата
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	СписаниеСТаможенногоСкладаТовары.ПартияТаможни КАК ПартияТаможни1,
		                      |	СписокПартий.Номенклатура,
		                      |	СписокПартий.ПартияТаможни
		                      |ИЗ
		                      |	СписокПартий КАК СписокПартий
		                      |		ПОЛНОЕ СОЕДИНЕНИЕ Документ.СписаниеСТаможенногоСклада.Товары КАК СписаниеСТаможенногоСкладаТовары
		                      |		ПО СписокПартий.Номенклатура = СписаниеСТаможенногоСкладаТовары.Номенклатура
		                      |			И (СписаниеСТаможенногоСкладаТовары.Ссылка = &Ссылка)
		                      |			И СписокПартий.ПартияТаможни = СписаниеСТаможенногоСкладаТовары.ПартияТаможни
		                      |ГДЕ
		                      |	СписаниеСТаможенногоСкладаТовары.ПартияТаможни ЕСТЬ NULL ");
		
		Запрос.УстановитьПараметр("Дата", 			Ссылка.МоментВремени());
		Запрос.УстановитьПараметр("Склад", 			Ссылка.СкладОтправитель);
		Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
		
			
	Выполнение = Запрос.Выполнить();
	Если Не Выполнение.Пустой() Тогда
		
		Отказ = Истина;
		
		Выборка = Выполнение.Выбрать();
		Пока Выборка.Следующий() Цикл

		 	ОбщиеФункции.СообщитьТекст(НСтр("ru = 'Партии таможни заполненны не верно! '; de = 'Gefüllt Partie ist nicht wahr! '") + Выборка.Номенклатура);
			
		КонецЦикла;
	КонецЕсли;

	  
КонецПроцедуры
